<a id="16"></a> <br>
# Dealing with Corrupt and Missing Data:


Sometimes, when we use it, it may not come out properly. Sometimes the loss is lost and it can take us away from our goal. Unfortunately we will explain on this page. But first, a missing data should be attempted.

In [99]:
arr = np.array([[10,20,np.nan],[3,np.nan,np.nan],[13,np.nan,4]])
arr

array([[10., 20., nan],
       [ 3., nan, nan],
       [13., nan,  4.]])


As it is understood, the 'np.nan' code creates a 'Not a Number' in the data.

In [100]:
df = pd.DataFrame(arr, index = ['Index1','Index2','Index3'],columns = ['Column1','Column2','Column3'] )
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      3.0      NaN      NaN
Index3     13.0      NaN      4.0

And this is how we synced this data to a DataFrame.
I am not saying that you should use the steps you will see after that. However, the steps you may review may vary depending on the desired or searched data. Sometimes, parameters such as average, 0, 1 and standard deviation can be placed in places where data is missing. Sometimes it is deleted directly. This is entirely up to what you want to do.

In [101]:
df.dropna()

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []


For example, the code above deletes if there is at least one 'NaN' in the 'Index' line.

In [102]:
df.dropna(axis = 1)

        Column1
Index1     10.0
Index2      3.0
Index3     13.0


When we set the 'Axis' parameter according to 'Column', it returns 'Column1' to us with no 'NaN' value and deletes the others. At the same time, it is not permanent unless you give the 'inplace' value 'True'.

In [103]:
df.dropna(thresh = 2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     13.0      NaN      4.0


What do you think is the 'thresh' parameter? Let's say now. It means "delete if there is at least two smooth data". Of course, you determine this number.

In [104]:
df.fillna(value = 0)

        Column1  Column2  Column3
Index1     10.0     20.0      0.0
Index2      3.0      0.0      0.0
Index3     13.0      0.0      4.0


This code assigns the 'value' value it contains to blank data. In the example, '0' is given and assigned to 'NaN' values. 'String' can be valued as well as quite functional.
Let us assume that the structure of the data is appropriate and that the data we are looking for is independent of the mean, and we assign the mean to the 'NaN' values.

In [105]:
df.sum()

Column1    26.0
Column2    20.0
Column3     4.0
dtype: float64

In [106]:
df.sum().sum()

50.0


You may have noticed that the first code gives the sum of each 'Column' value as seen, and the Next code sums it all.

In [107]:
df.fillna(value = (df.sum().sum())/ 5)

        Column1  Column2  Column3
Index1     10.0     20.0     10.0
Index2      3.0     10.0     10.0
Index3     13.0     10.0      4.0

If we set this logic to 'value' and divide it by 5 (to get an average), it will assign '10' instead of 'NaN' values.
With the same logic, we can also make values ​​such as standard deviation and variance. But we explained this in our previous article and you can easily apply the code there.
Sometimes it is quite functional in simpler queries.

In [108]:
df.size

9


Questions how many data there are.

In [109]:
df.isnull()

        Column1  Column2  Column3
Index1    False    False     True
Index2    False     True     True
Index3    False     True    False


Values ​​that are 'True' represent 'NaN'.

In [110]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64


This code is the answer to the question 'How many' NaN 'do you have in' Column '?

In [111]:
df.isnull().sum().sum()

4


This code gives the total number of 'NaN' values.
If we know how many data there are and how many 'NaN' values ​​are there with the above code, we can also find out how many smooth data is in each 'Column'.

In [112]:
df.size - df.isnull().sum()

Column1    9
Column2    7
Column3    7
dtype: int64


Here is the distribution of the amount of smooth data we mentioned in this code according to the 'columns'.

<a id="17"></a> <br>
# GroupBy Operations:


GroupBy Operations are exactly the same as in Sql tables. Be comfortable even if you don't know sql. It is not a difficult issue, but an important one. It shows the desired situation to my groups.

In [113]:
data = {'Job': ['Data Mining','CEO','Lawyer','Lawyer','Data Mining','CEO'],'Labouring': ['Immanuel','Jeff','Olivia','Maria','Walker','Obi-Wan'], 'Salary': [4500,30000,6000,5250,5000,35000]}
data

{'Job': ['Data Mining', 'CEO', 'Lawyer', 'Lawyer', 'Data Mining', 'CEO'],
 'Labouring': ['Immanuel', 'Jeff', 'Olivia', 'Maria', 'Walker', 'Obi-Wan'],
 'Salary': [4500, 30000, 6000, 5250, 5000, 35000]}


After creating our data, we throw it into the DataFrame.

In [114]:
df = pd.DataFrame(data)
df

           Job Labouring  Salary
0  Data Mining  Immanuel    4500
1          CEO      Jeff   30000
2       Lawyer    Olivia    6000
3       Lawyer     Maria    5250
4  Data Mining    Walker    5000
5          CEO   Obi-Wan   35000

In [115]:
SalaryGroupBy = df.groupby('Salary')
SalaryGroupBy


And we were grouped according to the 'Salary' feature.

In [116]:
SalaryGroupBy.sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [117]:
SalaryGroupBy.min()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan

In [118]:
SalaryGroupBy.max()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan


As you can see, whatever function you use, it will come in a table.

In [119]:
df.groupby('Salary').sum()

                Job Labouring
Salary
4500    Data Mining  Immanuel
5000    Data Mining    Walker
5250         Lawyer     Maria
6000         Lawyer    Olivia
30000           CEO      Jeff
35000           CEO   Obi-Wan


The above two codes are done by the above code alone.

In [120]:
df.groupby('Job').sum().loc['CEO'] #Total of salaries of CEOs.

Salary    65000
Name: CEO, dtype: int64

In [121]:
df.groupby('Job').count()

             Labouring  Salary
Job
CEO                  2       2
Data Mining          2       2
Lawyer               2       2

In [122]:
df.groupby('Job').min()

            Labouring  Salary
Job
CEO              Jeff   30000
Data Mining  Immanuel    4500
Lawyer          Maria    5250


The functions in the Numpy script can also be used here.

In [123]:
df.groupby('Job').min()['Salary']

Job
CEO            30000
Data Mining     4500
Lawyer          5250
Name: Salary, dtype: int64

In [124]:
df.groupby('Job').min()['Salary']['Lawyer']

5250


In the first, we grouped according to 'Salary' and showed the lowest salaries. Then we showed the salary of the lowest salary lawyer.

In [125]:
df.groupby('Job').mean()['Salary']['CEO']

32500


Here, we sorted the profession and found the average salary of the CEOs. GroupBy Operations is not a difficult issue as seen. It is a very concise subject.

<a id="18"></a> <br>
# Concatenate Merge And Join Functions:


Let's start with Concatenate first. Basically, we do the joining process with this function. It is like the 'zip' function in the same lists.

In [126]:
data = {'A': ['A1','A2','A3','A4'],'B': ['B1','B2','B3','B4'],'C': ['C1','C2','C3','C4']}
data1 = {'A': ['A5','A6','A7','A8'],'B': ['B5','B6','B7','B8'],'C': ['C5','C6','C7','C8']}
df1 = pd.DataFrame(data, index = [1,2,3,4])
df2 = pd.DataFrame(data1, index = [5,6,7,8])
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [127]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8


Let's create two data sets. And let's combine it as follows.

In [128]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8


It could also be combined.

In [129]:
pd.concat([df1,df2], axis = 1)

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8


The data that is not here is of course assigned as 'NaN'. This process can be used not only in 2 cases but also in larger numbers.




Let's continue with Join. The 'Join' functions can be thought of as joining transactions under the name. And it can also be thought of as 'clusters' in high school. So let's create two data and start doing these things.

In [130]:
data1 = {
        'id': ['1', '2', '3', '4', '5'],
        'Feature1': ['A', 'C', 'E', 'G', 'I'],
        'Feature2': ['B', 'D', 'F', 'H', 'J']}

In [131]:
df1 = pd.DataFrame(data1, columns = ['id', 'Feature1', 'Feature2'])
df1

  id Feature1 Feature2
0  1        A        B
1  2        C        D
2  3        E        F
3  4        G        H
4  5        I        J

In [132]:
data2 = {
        'id': ['1', '2', '6', '7', '8'],
        'Feature1': ['K', 'M', 'O', 'Q', 'S'],
        'Feature2': ['L', 'N', 'P', 'R', 'T']}

In [133]:
data = {'A': ['A1','A2','A3','A4'],'B': ['B1','B2','B3','B4'],'C': ['C1','C2','C3','C4']}
data1 = {'A': ['A5','A6','A7','A8'],'B': ['B5','B6','B7','B8'],'C': ['C5','C6','C7','C8']}
df1 = pd.DataFrame(data, index = [1,2,3,4])
df2 = pd.DataFrame(data1, index = [5,6,7,8])
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [134]:
df2 = pd.DataFrame(data2, columns = ['id', 'Feature1', 'Feature2'])
df2

  id Feature1 Feature2
0  1        K        L
1  2        M        N
2  6        O        P
3  7        Q        R
4  8        S        T


Let's start with 'Left Join'.



Left Join is exactly the same as 'Left Join' in Sql. Its function is given above. Here you should consider ‘df1 as table1 and, df2 as table2.

In [135]:
df1.join(df2)

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T


What do you think would happen if we do the opposite?

In [136]:
df2.join(df1)

  id Feature1 Feature2    A    B    C
0  1        K        L  NaN  NaN  NaN
1  2        M        N   A1   B1   C1
2  6        O        P   A2   B2   C2
3  7        Q        R   A3   B3   C3
4  8        S        T   A4   B4   C4


The same logic can be executed with Right Join. Its function and code are given below.

In [137]:
df1.join(df2, how = 'right')

     A    B    C id Feature1 Feature2
0  NaN  NaN  NaN  1        K        L
1   A1   B1   C1  2        M        N
2   A2   B2   C2  6        O        P
3   A3   B3   C3  7        Q        R
4   A4   B4   C4  8        S        T


Next are the 'inner' and 'outer' join functions.

In [138]:
df1.join(df2, how ='outer')

     A    B    C id Feature1 Feature2
0  NaN  NaN  NaN  1        K        L
1   A1   B1   C1  2        M        N
2   A2   B2   C2  6        O        P
3   A3   B3   C3  7        Q        R
4   A4   B4   C4  8        S        T

In [139]:
df1.join(df2, how = 'inner')

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

In [140]:
df1.join(df2, sort = 'True')

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

In [141]:
df1.join(df2, sort = 'False')

    A   B   C id Feature1 Feature2
1  A1  B1  C1  2        M        N
2  A2  B2  C2  6        O        P
3  A3  B3  C3  7        Q        R
4  A4  B4  C4  8        S        T

In [142]:
frames = [df1,df2]
df_keys = pd.concat(frames, keys=['x', 'y'])
df_keys

/opt/conda/lib/python3.6/site-packages/ipykernel_launcher.py:2: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

       A    B    C Feature1 Feature2   id
x 1   A1   B1   C1      NaN      NaN  NaN
  2   A2   B2   C2      NaN      NaN  NaN
  3   A3   B3   C3      NaN      NaN  NaN
  4   A4   B4   C4      NaN      NaN  NaN
y 0  NaN  NaN  NaN        K        L    1
  1  NaN  NaN  NaN        M        N    2
  2  NaN  NaN  NaN        O        P    6
  3  NaN  NaN  NaN        Q        R    7
  4  NaN  NaN  NaN        S        T    8


Black text is a warning message, not an error. Don't take it too seriously. Sometimes it can give a warning about the version.


The merge process is quite similar to the join process, but has some different features. We will explain in more detail below.


Above, you can see all the parameters of the Merge process. But we will not use many of them.

In [143]:
dataset1 = {'A':['A1','A2','A3'], 'B': ['B1','B2','B3'], 'Key': ['K1','K2','K3']}
dataset2 = {'X':['X1','X2','X3','X4'], 'Y': ['Y1','Y2','Y3','Y4'], 'Key': ['K1','K2','K3','K4']}
df1 = pd.DataFrame(dataset1,index = [1,2,3])
df2 = pd.DataFrame(dataset2,index = [1,2,3,4])
df1

    A   B Key
1  A1  B1  K1
2  A2  B2  K2
3  A3  B3  K3

In [144]:
df2

    X   Y Key
1  X1  Y1  K1
2  X2  Y2  K2
3  X3  Y3  K3
4  X4  Y4  K4

We can start according to the fact that we have created our data.

In [145]:
pd.merge(df1,df2, on = 'Key')

    A   B Key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2
2  A3  B3  K3  X3  Y3


And we even met our first parameter. You need to write the key to the 'On' parameter. The key should have an important place in your data so that it can be a 'key' in the real sense.

In [146]:
pd.merge(df1,df2, on = 'Key', how = 'left')

    A   B Key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2
2  A3  B3  K3  X3  Y3


We are already familiar with the 'How' parameter from Join. The values ​​of 'inner', 'outer', 'right' that you see there are also valid here.

In [147]:
pd.merge(df1,df2, on = 'Key', how = 'right')

     A    B Key   X   Y
0   A1   B1  K1  X1  Y1
1   A2   B2  K2  X2  Y2
2   A3   B3  K3  X3  Y3
3  NaN  NaN  K4  X4  Y4

In [148]:
pd.merge(df1,df2, on = 'Key', how = 'outer')

     A    B Key   X   Y
0   A1   B1  K1  X1  Y1
1   A2   B2  K2  X2  Y2
2   A3   B3  K3  X3  Y3
3  NaN  NaN  K4  X4  Y4

In [149]:
pd.merge(df1,df2, on = 'Key', how = 'inner')

    A   B Key   X   Y
0  A1  B1  K1  X1  Y1
1  A2  B2  K2  X2  Y2
2  A3  B3  K3  X3  Y3

In [150]:
pd.merge(df1,df2, on = 'Key', how = 'right',right_index=True)

       A    B Key   X   Y
1.0   A1   B1  K1  X1  Y1
2.0   A2   B2  K2  X2  Y2
3.0   A3   B3  K3  X3  Y3
NaN  NaN  NaN  K4  X4  Y4

In [151]:
pd.merge(df1,df2, left_index=True, right_index=True, how='outer')

     A    B Key_x   X   Y Key_y
1   A1   B1    K1  X1  Y1    K1
2   A2   B2    K2  X2  Y2    K2
3   A3   B3    K3  X3  Y3    K3
4  NaN  NaN   NaN  X4  Y4    K4

In [152]:
pd.merge(df1,df2, left_index=True, right_index=True, how='inner')

    A   B Key_x   X   Y Key_y
1  A1  B1    K1  X1  Y1    K1
2  A2  B2    K2  X2  Y2    K2
3  A3  B3    K3  X3  Y3    K3


The 'left_index' and 'right_index' parameters are simple enough to be understood from the codes. Other parameters are almost not used.but if you want you can[ search](https://pandas.pydata.org/)

Xüsusi Təşəkkürlər: <a href = "https://www.linkedin.com/in/batuhan-bayraktar-a212b418a/">Batuhan Bayraktar</a><br>
Yazar: <a href = "https://www.linkedin.com/in/ramazan-nuhbalayev/details/featured/">Nuhbalayev Ramazan</a><br>
Kod Mənbəsi: <br> <a href = "https://medium.com/deep-learning-turkiye/adan-z-ye-pandas-tutoriali-başlangıç-ve-orta-seviye-4edf0094e0d5">A’dan Z’ye Pandas Tutoriali (Başlangıç ve Orta Seviye)</a> və <a href = "https://www.kaggle.com/code/batuhan35/data-science-for-everyone/notebook">Kaggle: batuhan35</a>